## Q1. List any five functions of the pandas library with execution.

Read Data
We can read data in pandas data frame as read_csv(). Two most used data read formats are csv and excel. If we are reading data in excel format, we can also give sheet names as follows. There are other less used options of other file types too.


2. Head and Tail

To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. In contrast to see below rows, we can use df.tail().



3. Shape, Size and Info

Two most basic functions after reading data is to know the number of rows and columns, and to know the datatype of variables. We can use df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame. We can also use df.info(), from that we get different information such as rows from RangeIndex, Data columns and then data type of each column. It also includes the information of non-null counts.


4. isna

But, if one needs to get the total number of null values in a data, we can use df.isna() as below. Sum will give the total null values. If we want just one variable null values, we can also get it by giving the name of the variable as below.



5. Describe

Then to understand basic statistics of variables we can use df.describe(). It will give you count, mean, standard deviation, and also 5 number summary.



6. Nunique

To get the total unique values of variables, we can use df.nunique(). It will give all the unique values a variable contains.



7. Value Counts

Also to get the unique values of a single variable, we can use df.anaemia.value_counts(). For demonstration, only variables with boolean values are given below. count_values() returns counts of unique values. The resulting object will be in descending order. This function excludes NA values by default.



If we make any changes in the data and want to write it to a comma-separated values (csv) file, we can use to_csv(). In this for index default is true.



8. Columns

To know the names of all the variables in a data frame, we can use df.columns.

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
import pandas as pd

dict_df = {'A':[1,2,3,4],
          'B':[2,3,4,5],
          'C':[3,4,5,6]
          }
df = pd.DataFrame(dict_df)
df

   A  B  C
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6

In [18]:
new_df = df.reindex([1,3])

In [19]:
new_df

   A  B  C
1  2  3  4
3  4  5  6

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [20]:
df = pd.DataFrame({'Name':['A','B','C','D','E'],'Values':[10,20,30,40,50]})

In [21]:
df

  Name  Values
0    A      10
1    B      20
2    C      30
3    D      40
4    E      50

In [22]:
df['Values']

0    10
1    20
2    30
3    40
4    50
Name: Values, dtype: int64

In [26]:
list_values = list(df['Values'])
list_values

[10, 20, 30, 40, 50]

In [27]:
s = 0 
for values in list_values[0:3]:
    s = s+values 

print(s)

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [73]:
df2 = pd.DataFrame({'Name':['A','B','C','D'],'Text':['ab','bcd','cdef','defgh']})
df2

  Name   Text
0    A     ab
1    B    bcd
2    C   cdef
3    D  defgh

In [74]:
def count_word():
    df2['Word_Count'] = pd.Series([len(a) for a in df2['Text']])

In [76]:
count_word()

In [77]:
df2

  Name   Text  Word_Count
0    A     ab           2
1    B    bcd           3
2    C   cdef           4
3    D  defgh           5

## Q5. How are DataFrame.size() and DataFrame.shape() different?

Syntax: dataframe.size
Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape
Return : Returns tuple of shape (Rows, columns) of dataframe/series

Syntax: dataframe.ndim
Return : Returns dimension of dataframe/series. 1 for one dimension (series), 2 for two dimension (dataframe)

## Q6. Which function of pandas do we use to read an excel file?

pandas.read_excel()

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [1]:
import pandas as pd

df = pd.DataFrame({'email':['adrik@gmail.com','soham@gmail.com','alakh@gmail.com']})
df

             email
0  adrik@gmail.com
1  soham@gmail.com
2  alakh@gmail.com

In [5]:
def extract_name(email):
    name_part = email.split('@')
    name = name_part[0]
    return name

In [7]:
df['Username'] = df['email'].apply(extract_name)

In [8]:
df

             email Username
0  adrik@gmail.com    adrik
1  soham@gmail.com    soham
2  alakh@gmail.com    alakh

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [11]:
df2 = pd.DataFrame({'A':[3,8,6,2,9],
                  'B':[5,2,9,3,1],
                  'C':[1,7,4,5,2]}
                  )
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [12]:
def slicer(obj,upper,lower):
    return obj[upper:(lower+1)]

In [14]:
slicer(df2,0,3)

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [2]:
import pandas as pd
dfv = pd.DataFrame({'Values':[1,2,3,4,5,6]})
dfv

   Values
0       1
1       2
2       3
3       4
4       5
5       6

In [3]:
dfv.describe()

         Values
count  6.000000
mean   3.500000
std    1.870829
min    1.000000
25%    2.250000
50%    3.500000
75%    4.750000
max    6.000000

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.|

In [1]:
import pandas as pd
dates = data = pd.date_range(start = '2023-01-01' ,end = '2023-01-05')

In [2]:
df = pd.DataFrame({"Dates":dates})

In [3]:
df

       Dates
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [8]:
df['WeekDay'] = df['Dates'].dt.weekday

In [9]:
df

       Dates  WeekDay
0 2023-01-01        6
1 2023-01-02        0
2 2023-01-03        1
3 2023-01-04        2
4 2023-01-05        3

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [10]:
import pandas as pd